app/controllers/photos_controller.rb

SELECT * FROM `photos` WHERE (pub_date <= NOW()) ORDER BY pub_date DESC LIMIT 15
SELECT * FROM `photos` ORDER BY pub_date DESC
---
  def index

    # TODO: sort by published photos, only
    @photos = Photo.find(:all, :order => "pub_date DESC", :conditions => "pub_date <= NOW()", :limit => 15)

    @latest_photo = @photos.first

SELECT * FROM `photos` WHERE (pub_date <= NOW() AND id < 5) ORDER BY pub_date DESC LIMIT 1
---
  def show
    @photo = Photo.find(params[:id])

SELECT * FROM `photos` WHERE (`photos`.`id` = 1)
---
  def edit
    @photo = Photo.find(params[:id])

INSERT INTO `photos` (`created_at`, `title`, `updated_at`, `caption`, `pub_date`, `img_url`) VALUES('2009-12-25 01:36:40', 'Oh yes!', '2009-12-25 01:36:40', 'fjasdkfjasd', '2009-12-26 01:36:00', 'asdfads')
---
  def create
    @photo = Photo.new(params[:photo])

    respond_to do |format|
      if @photo.save

SELECT * FROM `photos` WHERE (`photos`.`id` = 1)
UPDATE `photos` SET `updated_at` = '2009-12-25 18:19:48', `flickr_url` = '', `caption` = 'more cooking photos!\r\n\r\n<a href=\"\">asdfadsf</a>' WHERE `id` = 4
---
  def update
    @photo = Photo.find(params[:id])

    respond_to do |format|
      if @photo.update_attributes(params[:photo])